# AdditionalBottomCoverOffset Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
AreaReinforcement..::..AdditionalBottomCoverOffset Property
AreaReinforcement Class See Also
---
Additional offset from the bottom or interior cover reference.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double AdditionalBottomCoverOffset { get; set; }
```

Visual Basic
---
```text
Public Property AdditionalBottomCoverOffset As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double AdditionalBottomCoverOffset {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for additionalBottomCoverOffset must be no more than 30000 feet in absolute value. |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |

# See Also
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace